[
    {
        "title": "Hello World!",
        "date": "October 9th, 2021",
        "content": "Hello world! this is my first blog post on my site. Right now, the whole site is still a WIP, but it'll get better and better as time goes on.<br>Before I continue, i just want to say a huge thanks to a friend of mine named def-sa, as without them I probably would've never done any of this stuff.",
        "edited": true,
        "edited_date": "October 9th, 2021"
    },
    {
        "title": "Scream Fortress 13",
        "date":"October 9th, 2021",
        "content":"It's that time of the year, Valve comes out of hiding to give us a month of spoopy and chaotic games on special maps with contracts!<br>I haven't played too much lately, but probably will later because of it, as i love the chaos TF2 brings<br>This new Scream Fortress brings 6 new maps, 25 community-made cosmetics, 5 of which are holloween restricted, 28 new unusual effects, and of course the contracts are back<br>Unfortunately, the bots are still around, so do your duty and kick any you can, and dont get fooled by the name-stealing ones to kick your teammates!",
        "edited":false,
        "edited_date":null
    },
    {
        "title": "2022 Ford Mustangs",
        "date": "October 11th, 2021",
        "content": "For many months, there had been rumors floating around about how 2022 mustang orders start October 11th<br>turns out, they were right. today, not only did the order guide release, <a href=\"https://www.mustang6g.com/forums/attachments/2022-mustang-order-guide-pdf.620985\" target=\"_blank\" rel=\"noopener noreferrer\"> link here</a>, but internally Ford had stated that orders start today too!<br>unfortunately, the guy who normally orders new vehicles at my work was out and may be for a bit, but the moment he comes back, i'm putting in an order for sure<br>what's new? well, i'm glad you asked, there's quite a few, but i'll list the good stuff<br>Legend: 100A, 101A - Ecoboost, 200A, 201A - Ecoboost Premium, 300A, 301A - GT, 400A, 401A - GT Premium, 600A - Mach 1, 700A - Mach 1 Premium<br> Ecoboost: Costal Limited Package (100A-201A), Stealth Package (200A, 201A), Carbon Sport Interior and Pony Packages removed<br>GT: - 10hp and 10lb-ft decrease due to emissions<br>multiple trim levels: + Security Package (101A-700A), Ice White Appearance Package (201A, 400A, 401A), Premium floor liners without carpet mats (100A, 101A, 200A, 300A, 301A, 400A)<br>As you can see, we have some new packages and some Ecoboost ones were removed, plus a slight decrease in power due to emissions testing<br>now, let's move on to colors where we lost 4 and got 7 new ones<br>Removed: Antimatter Blue, Grabber Yellow, Twister Orange, and Velocity Blue<br>Added: Atlas Blue, Brittany Blue, Cyber Orange, Dark Matter Gray, Eruption Green, Grabber Blue, and Mischievous Purple<br><table class=\"center\"><tr><th></th><th>100A</th><th>101A</th><th>200A</th><th>201A</th><th>300A</th><th>301A</th><th>400A</th><th>401A</th><th>600A</th><th>700A</th><th>Notes</th><th>Mach 1 Accent</th></tr><tr><th>Grabber Blue</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>none</th><th>white</th></tr><th>Atlas Blue</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>❌</th><th>❌</th><th>none</th><th>N/A</th></tr><th>Brittany Blue</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>Costal Limited Package Only</th><th>N/A</th></tr><th>Eruption Green</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>none</th><th>white</th></tr><th>Dark Matter Gray</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>none</th><th>red</th></tr><th>Mischievous Purple</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>none</th><th>white</th></tr><th>Cyber Orange</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>none</th><th>white</th></tr></table>and with that, that's all really interesting about the 2022 mustang<br>my comments and notes: it seems some people really don't like the 10hp lost, but i personally think it's no big deal<br>i also want to know what was going through Ford's head when they decided that Shadow Black and Dark Matter Gray have red accents, but Mischievous Purple has white, despite the fact it's base color is black, and that Cyber Orange also has white accents",
        "edited":true,
        "edited_date":"October 18th, 2021"
    },
    {
        "title": "More Mustang Stuff",
        "date": "October 13th, 2021",
        "content": "Whew, that was a big post Monday, but i have a few more things to share, mainly how the new paint colors look<br>some colors are from other vehicles, but some are also brand new entirely, which is a nice sendoff for the 6th gen mustang, seeing as the 2023 model year will be a new generation<br><br><a class=\"colortext\">all images are from mustangfanclub, so credit to them</a><br><img src=\"https://mustangfanclub.com/wp-content/uploads/2021/08/IMG_4669.jpg\" loading=\"lazy\"><br>this was the leaked image of all the paint colors, but it was missing Brittany Blue and Oil Slick Blue-Purple was renamed (i like oil slick better)<br>here's some pictures of 4 of the paints, too<br><img class=\"medimg\" loading=\"lazy\" src=\"https://mustangfanclub.com/wp-content/uploads/2021/08/Eruption-Green-3.jpeg\"> <img class=\"medimg\" loading=\"lazy\" src=\"https://mustangfanclub.com/wp-content/uploads/2021/08/Oil-Slick-3.jpeg\"> <img class=\"medimg\" loading=\"lazy\" src=\"https://mustangfanclub.com/wp-content/uploads/2021/08/Dark-Matter-Gray-2-scaled.jpg\"> <img class=\"medimg\" loading=\"lazy\" src=\"https://mustangfanclub.com/wp-content/uploads/2021/08/Grabber-Blue-scaled.jpg\"><br>in order, Eruption Green, Mischievous Purple, Dark Matter Gray, and Grabber Blue<br>i also found out yesterday that one of the discontinued packages, Carbon Sport Interior, had actual carbon fiber on the dash, which is an otherwise GT500-only option, and was not the one with the fake carbon fiber-styled plastic like i thought<br><br>side note: with every new blog post, i will be adding at least one new splash to the as of now 422 of them, and there's some special ones too",
        "edited":false,
        "edited_date":null
    },
    {
        "title": "Exciting News!",
        "date": "October 21st, 2021",
        "content": "I just got back from the dealership, i believe the order for my 2022 Mustang Mach 1 has been put in!<br>got 700A, 10-speed auto, Handling Package, Elite Package and Nav in Mischievous Purple<br>i cant even describe how excited i am, but i've read that because of the tires the handling package has, it may not start production until March of 2022 or something along those lines<br>i don't know how true that is, but i'm excited either way, and taking care of my current vehicle paid off with an estimated $25k trade in value<br>will keep everyone updated",
        "edited": false,
        "edited_date":null
    },
    {
        "title": "Forza Horizon 5",
        "date": "November 15th, 2021",
        "content": "Sorry it's been so long since my last blog post, been doing life stuff and playing Forza Horizon 5, really fun game worth every penny<br><br>yeah, that's really it, i'll be letting everyone know when i finally get a production date for the mustang, but nothing yet",
        "edited": false,
        "edited_date":null
    },
    {
        "title": "Merry Christmas",
        "date": "December 24th, 2021",
        "content": "Just wanted to pop in and say merry christmas and happy holidays<br>unfortunately, mine won't be so happy, as this morning i lost my dog Checkers<br>we had her 15 years and she lived to be 16 years old<br><img loading=\"lazy\" src=\"./blog/pics/checkers.png\"><br>rest in peace, my precious little pup, i'll always miss you",
        "edited":false,
        "edited_date":null
    },
    {
        "title": "Haven't Forgotten!",
        "date": "February 17th, 2022",
        "content": "Nope, i haven't forgotten about the site or the blog, just been busy with other stuff in my life, but i have a small update that should improve site performance a bit as well as introduce a new loading screen!<br>I also heard that my friend def-sa has put out a new version of their site, so that's exciting. As for me, i really like how this site looks right now, but i will be making more and more improvements as time goes on. Lastly, i did some testing on the Switch and it seems most all of the site's features work, even splashes and you can also select the navigation buttons, which was completely on accident, but really cool anyways.<br>In other news, i still don't have a production date on the Mustang yet, but i've heard that production of the Handling Package Mach 1s (of which mine is) could start between late february and early april, but one date i've heard a lot is march 21st. I also read that Flat Rock (the place where they make Mustangs) will be shutting down for 3-4 weeks for re-tooling, so maybe that has something to do with the M1 HPs? I've also gotten to see the redesigned California Special package and the Dark Matter Gray and Eruption Green colors, though the latter was on a Bronco, and Ford is really going all out with these cool new colors!<br>That's about it for this post, see you all soon!",
        "edited":false,
        "edited_date":null
    }
]