[
    {
        "title": "Hello World!",
        "date": "October 9th, 2021",
        "content": "Hello world! this is my first blog post on my site. Right now, the whole site is still a WIP, but it'll get better and better as time goes on.<br>Before I continue, i just want to say a huge thanks to a friend of mine named def-sa, as without them I probably would've never done any of this stuff.",
        "edited": true,
        "edited_date": "October 9th, 2021"
    },
    {
        "title": "Scream Fortress 13",
        "date":"October 9th, 2021",
        "content":"It's that time of the year, Valve comes out of hiding to give us a month of spoopy and chaotic games on special maps with contracts!<br>I haven't played too much lately, but probably will later because of it, as i love the chaos TF2 brings<br>This new Scream Fortress brings 6 new maps, 25 community-made cosmetics, 5 of which are holloween restricted, 28 new unusual effects, and of course the contracts are back<br>Unfortunately, the bots are still around, so do your duty and kick any you can, and dont get fooled by the name-stealing ones to kick your teammates!",
        "edited":false,
        "edited_date":null
    },
    {
        "title": "2022 Ford Mustangs",
        "date": "October 11th, 2021",
        "content": "For many months, there had been rumors floating around about how 2022 mustang orders start October 11th<br>turns out, they were right. today, not only did the order guide release, <a href=\"https://www.mustang6g.com/forums/attachments/2022-mustang-order-guide-pdf.620985\" target=\"_blank\" rel=\"noopener noreferrer\"> link here</a>, but internally Ford had stated that orders start today too!<br>unfortunately, the guy who normally orders new vehicles at my work was out and may be for a bit, but the moment he comes back, i'm putting in an order for sure<br>what's new? well, i'm glad you asked, there's quite a few, but i'll list the good stuff<br>Legend: 100A, 101A - Ecoboost, 200A, 201A - Ecoboost Premium, 300A, 301A - GT, 400A, 401A - GT Premium, 600A - Mach 1, 700A - Mach 1 Premium<br> Ecoboost: Costal Limited Package (100A-201A), Stealth Package (200A, 201A), Carbon Sport Interior and Pony Packages removed<br>GT: - 10hp and 10lb-ft decrease due to emissions<br>multiple trim levels: + Security Package (101A-700A), Ice White Appearance Package (201A, 400A, 401A), Premium floor liners without carpet mats (100A, 101A, 200A, 300A, 301A, 400A)<br>As you can see, we have some new packages and some Ecoboost ones were removed, plus a slight decrease in power due to emissions testing<br>now, let's move on to colors where we lost 4 and got 7 new ones<br>Removed: Antimatter Blue, Grabber Yellow, Twister Orange, and Velocity Blue<br>Added: Atlas Blue, Brittany Blue, Cyber Orange, Dark Matter Gray, Eruption Green, Grabber Blue, and Mischievous Purple<br><table class=\"center\"><tr><th></th><th>100A</th><th>101A</th><th>200A</th><th>201A</th><th>300A</th><th>301A</th><th>400A</th><th>401A</th><th>600A</th><th>700A</th><th>Notes</th><th>Mach 1 Accent</th></tr><tr><th>Grabber Blue</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>none</th><th>white</th></tr><th>Atlas Blue</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>❌</th><th>❌</th><th>none</th><th>N/A</th></tr><th>Brittany Blue</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>❌</th><th>Costal Limited Package Only</th><th>N/A</th></tr><th>Eruption Green</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>none</th><th>white</th></tr><th>Dark Matter Gray</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>none</th><th>red</th></tr><th>Mischievous Purple</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>none</th><th>white</th></tr><th>Cyber Orange</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>✔️</th><th>none</th><th>white</th></tr></table>and with that, that's all really interesting about the 2022 mustang<br>my comments and notes: it seems some people really don't like the 10hp lost, but i personally think it's no big deal<br>i also want to know what was going through Ford's head when they decided that Shadow Black and Dark Matter Gray have red accents, but Mischievous Purple has white, despite the fact it's base color is black, and that Cyber Orange also has white accents",
        "edited":true,
        "edited_date":"October 18th, 2021"
    },
    {
        "title": "More Mustang Stuff",
        "date": "October 13th, 2021",
        "content": "Whew, that was a big post Monday, but i have a few more things to share, mainly how the new paint colors look<br>some colors are from other vehicles, but some are also brand new entirely, which is a nice sendoff for the 6th gen mustang, seeing as the 2023 model year will be a new generation<br><br><a class=\"colortext\">all images are from mustangfanclub, so credit to them</a><br><img src=\"https://mustangfanclub.com/wp-content/uploads/2021/08/IMG_4669.jpg\" loading=\"lazy\"><br>this was the leaked image of all the paint colors, but it was missing Brittany Blue and Oil Slick Blue-Purple was renamed (i like oil slick better)<br>here's some pictures of 4 of the paints, too<br><img class=\"medimg\" loading=\"lazy\" src=\"https://mustangfanclub.com/wp-content/uploads/2021/08/Eruption-Green-3.jpeg\"> <img class=\"medimg\" loading=\"lazy\" src=\"https://mustangfanclub.com/wp-content/uploads/2021/08/Oil-Slick-3.jpeg\"> <img class=\"medimg\" loading=\"lazy\" src=\"https://mustangfanclub.com/wp-content/uploads/2021/08/Dark-Matter-Gray-2-scaled.jpg\"> <img class=\"medimg\" loading=\"lazy\" src=\"https://mustangfanclub.com/wp-content/uploads/2021/08/Grabber-Blue-scaled.jpg\"><br>in order, Eruption Green, Mischievous Purple, Dark Matter Gray, and Grabber Blue<br>i also found out yesterday that one of the discontinued packages, Carbon Sport Interior, had actual carbon fiber on the dash, which is an otherwise GT500-only option, and was not the one with the fake carbon fiber-styled plastic like i thought<br><br>side note: with every new blog post, i will be adding at least one new splash to the as of now 422 of them, and there's some special ones too",
        "edited":false,
        "edited_date":null
    },
    {
        "title": "Exciting News!",
        "date": "October 21st, 2021",
        "content": "I just got back from the dealership, i believe the order for my 2022 Mustang Mach 1 has been put in!<br>got 700A, 10-speed auto, Handling Package, Elite Package and Nav in Mischievous Purple<br>i cant even describe how excited i am, but i've read that because of the tires the handling package has, it may not start production until March of 2022 or something along those lines<br>i don't know how true that is, but i'm excited either way, and taking care of my current vehicle paid off with an estimated $25k trade in value<br>will keep everyone updated",
        "edited": false,
        "edited_date":null
    },
    {
        "title": "Forza Horizon 5",
        "date": "November 15th, 2021",
        "content": "Sorry it's been so long since my last blog post, been doing life stuff and playing Forza Horizon 5, really fun game worth every penny<br><br>yeah, that's really it, i'll be letting everyone know when i finally get a production date for the mustang, but nothing yet",
        "edited": false,
        "edited_date":null
    },
    {
        "title": "Merry Christmas",
        "date": "December 24th, 2021",
        "content": "Just wanted to pop in and say merry christmas and happy holidays<br>unfortunately, mine won't be so happy, as this morning i lost my dog Checkers<br>we had her 15 years and she lived to be 16 years old<br><img loading=\"lazy\" src=\"./blog/pics/checkers.png\"><br>rest in peace, my precious little pup, i'll always miss you",
        "edited":false,
        "edited_date":null
    },
    {
        "title": "Haven't Forgotten!",
        "date": "February 17th, 2022",
        "content": "Nope, i haven't forgotten about the site or the blog, just been busy with other stuff in my life, but i have a small update that should improve site performance a bit as well as introduce a new loading screen!<br>I also heard that my friend def-sa has put out a new version of their site, so that's exciting. As for me, i really like how this site looks right now, but i will be making more and more improvements as time goes on. Lastly, i did some testing on the Switch and it seems most all of the site's features work, even splashes and you can also select the navigation buttons, which was completely on accident, but really cool anyways.<br>In other news, i still don't have a production date on the Mustang yet, but i've heard that production of the Handling Package Mach 1s (of which mine is) could start between late february and early april, but one date i've heard a lot is march 21st. I also read that Flat Rock (the place where they make Mustangs) will be shutting down for 3-4 weeks for re-tooling, so maybe that has something to do with the M1 HPs? I've also gotten to see the redesigned California Special package and the Dark Matter Gray and Eruption Green colors, though the latter was on a Bronco, and Ford is really going all out with these cool new colors!<br>That's about it for this post, see you all soon!",
        "edited":false,
        "edited_date":null
    },
    {
        "title": "Production Date!!",
        "date": "March 29th, 2022",
        "content": "New update on the mustang! I now have a production date and VIN, the production date is the week of May 9th, meaning it can be built between May 9th and 13th<br>Ford also finally put up the 2022 mustang build and price and according to that, this is how my mustang will look<br><img loading=\"lazy\" src=\"https://build.ford.com/dig/Ford/Mustang/2022/HD-TILE-ACC%5BEXTBCK%5D/Image%5B%7CFord%7CMustang%7C2022%7C1%7C1.%7C700A.P8R..PP2..88K.89V.~1KX00_BCMAD.68B.60K.SED.574.43M.WCC.12U.UCA.13S.COU.51H.MDS.853.90M.55C.64N.T3B.14L.RES.RWD.67G.96B.455.45T.990.19B.AFP.HSW.DIS.91N.50B.14A.SSR.583.912.SY3.67D.JCBAP.44U.MAC.PRE.PLT.%5D/EXT/1/vehicle.png\"><img loading=\"lazy\" src=\"https://build.ford.com/dig/Ford/Mustang/2022/HD-TILE-ACC%5BEXTBCK%5D/Image%5B%7CFord%7CMustang%7C2022%7C1%7C1.%7C700A.P8R..PP2..88K.89V.~1KX00_BCMAD.68B.60K.SED.574.43M.WCC.12U.UCA.13S.COU.51H.MDS.853.90M.55C.64N.T3B.14L.RES.RWD.67G.96B.455.45T.990.19B.AFP.HSW.DIS.91N.50B.14A.SSR.583.912.SY3.67D.JCBAP.44U.MAC.PRE.PLT.%5D/EXT/2/vehicle.png\"><br>Of course, there's going to be some color differences online vs irl, mainly the paint color and the accent color (mirror, wing, front side intake trim), but it still makes me so happy progress is happening!<br>I will update this post if anything changes, such as a new production date<br><br>Update: the production date has been pushed back to the week of May 16th, and Flat Rock will be down for the week of April 4th",
        "edited":true,
        "edited_date": "April 2nd, 2022"
    },
    {
        "title": "Production Date Update",
        "date": "April 15th, 2022",
        "content": "Some good news on the build date, I have now received a build day instead of a week, and the day is May 20th<br>That's about it for the actual update, but i've found many pictures of Mischievous Purple and I wanted to share them<br><a class=\"colortext\">all images are from users on mustang6g, so credit to them, all pictures belong to their respective owners</a><br><img class=\"medimg\" loading=\"lazy\" src=\"https://www.mustang6g.com/forums/attachments/car-at-dealer3-jpg.666887/\"><img class=\"bigimg\" loading=\"lazy\" src=\"https://www.mustang6g.com/forums/attachments/fcf56a81-2159-4137-93aa-408c00924b6a-jpeg.665123/\"><img class=\"bigimg\" loading=\"lazy\" src=\"https://www.mustang6g.com/forums/attachments/fb_img_1649098911897-jpg.664409/\"><br><img class=\"hugeimg\" loading=\"lazy\" src=\"https://www.mustang6g.com/forums/attachments/278107838_7910460652301080_3576608688763428716_n-jpg.666526/\"><img class=\"bigimg\" loading=\"lazy\" src=\"https://www.mustang6g.com/forums/attachments/a30b1d8f-0107-4d85-85a3-b060f6b264c7-jpeg.666998/\"><img class=\"medimg\" loading=\"lazy\" src=\"https://www.mustang6g.com/forums/attachments/3d4faf2d-cb06-4408-9af1-308a92598560-jpeg.667003/\"><br>All I can say is wow, I'm glad I chose this color, as before I put my order in, I was heavily split on it or Cyber Orange, but the more pictures I see of MP, the more glad I am with my choice<br>As of 4/24/22 my build date is still 5/20 so I think that's going to be it<br>As of 4/29/22 my build date is now 5/24, hoping that's the last move",
        "edited":true,
        "edited_date":"April 29th, 2022"
    },
    {
        "title": "Just a random post",
        "date": "April 30th, 2022",
        "content": "This is gonna be a short post, but it's an important one<br><br><a class=\"colortext\">Be who you want to be, not what others want you to be</a><br>Don't bend to the will of some strangers irl or online who want you to be a certain way, be the way you want<br><br><a class=\"colortext\">Don't settle, aim for what you truly want</a><br>Don't just say \"good enough\", go for what you want and will make you happy<br><br><a class=\"colortext\">Find yourself, and don't give up!</a><br>If you're ever worried you might not be who you truly are, go find your true self, and don't let anyone get in your way<br><br><a class=\"colortext\">You deserve to be happy</a><br>You deserve to be happy, don't let anyone take that joy from you. If you're not happy, do what you can to get to a place where you are<br><br><a class=\"colortext\">Enjoy your life</a><br><br>No, this wasn't a mustang update post, but who cares?",
        "edited": false,
        "edited_date": null,
        "pinned": true
    },
    {
        "title": "The day is coming!",
        "date": "May 7th, 2022",
        "content":"<div class=\"colortext\">Just a little longer until the day where my Mach 1 is built, below is the timer<br><iframe class=\"colorimage\" src=\"https://free.timeanddate.com/countdown/i8brlgaf/n77/cf11/cm0/cu5/ct1/cs1/ca0/co0/cr0/ss0/cac000/cpc000/pct/tcfff/fs200/szw576/szh243/iso2022-06-01T00:00:00\" allowtransparency=\"true\" frameborder=\"0\" width=\"538\" height=\"69\"></iframe></div><br>It's been a long wait since I put my order in, in fact by the 22nd, it will have been 7 months, and that's astounding to me. It's not felt that long, it feels like the next while is forever away, but it was just October of 2021<br>as of 5/13, the date was pushed back again, the timer has been updated<!-- made with https://www.timeanddate.com/clocks/freecountdown.html see screenshots folder for settings if it needs to be modified, hopefully not -->",
        "edited":true,
        "edited_date":"May 13th, 2022",
        "pinned":false
    },
    {
        "title": "Coming Soon!!",
        "date": "June 3rd, 2022",
        "content": "It's official! My Mustang has been built and will be shipping soon! Ford estimates between June 27th and July 5th, but hopefully it'll happen sooner than that!<br>not really much else to say for now",
        "edited": false,
        "edited_date": null,
        "pinned": false
    },
    {
        "title": "Updates!!!",
        "date": "July 17th, 2022",
        "content": "Wow, it's been a while, huh? Over a month since the last update, and i'm really sorry about that, but I have good news! It's here!!!!<br>I am now the owner of my Mach 1, it got delivered on the 14th, and I took it home on the 15th<br><img class=\"bigimg\" loading=\"lazy\" src=\"https://www.mustang6g.com/forums/attachments/1657956341833-png.688926/\"><br>I've decided to nickname it Rattlesnake and i love it so far",
        "edited": false,
        "edited_date": null,
        "pinned": false
    },
    {
        "title": "S650 Mustang",
        "date": "September 17th, 2022",
        "content": "Mon through Fri i was out in San Jose visiting a friend, and i completely forgot about the S650 mustang reveal.<br>I have to say, this is amazing, and i love every bit of it. At first, i wasn't a huge fan of the back, but it's grown on me. I especially like how Ford seems to be unifying the Mustang and the Mach E, and you can clearly see it with this new generation.<br><img class=\"hugeimg\" loading=\"lazy\" src=\"https://cdn.motor1.com/images/mgl/XBBxne/s1/2023-ford-mustang-mach-e-gt-and-2024-ford-mustang-gt.webp\"><br>For 2024, there are 5 different versions you can buy. Ecoboost, Ecoboost Convertible, GT, GT Convertible, and Dark Horse. As of now, the official power stats are unknown, but the GT is estimated to have 480hp, and the Dark Horse 500hp. Only the GT and DH will be able to get a manual, with the DH getting a Tremec 3160 and the GT some unknown Getreg transmission, but all will also be able to have the 10R80.<br>The brakes are interesting this time around, they've changed many ways. It seems that getting the Ecoboost with the high performance engine will up you to the full-spec brakes, but otherwise the EB will get 2-piston floating calipers with 320mm rotors. the GT will get 4-piston fixed calipers with 352mm rotors, and the Dark Horse/EB HP/GT PP will get 6-piston fixed calipers with 390mm rotors and some actual proper 4-piston rear calipers. You can also customize the colors of your brakes with either black, red, or blue, all with white text or silver with black text, unless you get a Dark Horse with the appearance package, then it's just dark blue with light blue text. All options can have a little Mustang logo put on them or the \"Brembo\" text replaced with \"Mustang\" though.<br>Moving on to the design, it all looks great on the outside and i'm soooo glad to see those pre-production wheels ended up being the GT Performance Package wheels. I love them and wish I could get them in the wide 10.5\" and 11\" widths. I also love the interior, the fact everything is more driver-oriented is great, but i'm not a huge fan of how the screens look carelessly pasted into place.<br><img class=\"hugeimg\" loading=\"lazy\" src=\"https://media.ford.com/content/dam/fordmedia/North%20America/US/2022/09/14/MustangDarkHorse/DARK%20HORSE%20AUTO.jpg/jcr:content/renditions/cq5dam.web.881.495.jpeg\"><br>This is gonna sound a bit crazy, but i'm considering putting an order in for a Dark Horse when the order banks open, assuming the price isn't too high. I know i just waited nearly 9 months for my Mach 1, but i quite like the Dark Horse. I guess i'll have to wait until pricing is available before i can say for sure whether or not i'm getting one. I also quite like the color it can come in, Blue Ember. I almost like it as much as Mischevious Purple. Almost.<br>Some other interesting stuff is that the S650 will have the new 4th Generation Coyote 5L V8. It's much like the Gen 3, being port and direct injected and all, but has dual 80mm throttle bodies, and the one in the Dark Horse will have the connecting rods and camshafts out of the 2020-2022 GT500. Supposedly, the S650 ECU is also \"locked\", but i bet that will be cracked open pretty quickly, knowing how many Mustang owners there are and how persistant the tuners are.<br>The Ecoboost owners also got some cool news, there is a brand-new 2.3L turbo I4 in the Ecoboost, sporting new pistons, conrods, cams, fuel delivery, air induction and an electronically controlled twin-scroll turbo, as well as a compression bump to 10.6:1 from 9.5:1, so it sounds like this will make more power from factory as well as being able to handle more power from mods. There's also rumors of the 6th gen Whipple supercharger coming to the S650.<br><br>Shoutouts to <a class=\"colortext\">Bendo, Raine, and Silver</a>, you guys are awesome.",
        "edited": false,
        "edited_date": null,
        "pinned":false
    },
    {
        "title": "FireFox",
        "date": "October 25th, 2022",
        "content": "Gonna keep this short, anyone who uses Chrome or a Chromium-based browser (Opera, Edge, Brave, etc) should know that in 2023, Google is going to effectively ban ad blockers, and if anyone has been on YouTube lately without an ad blocker, you would know that right now, they're getting incredibly out of hand with the ads.<br>If you haven't already, I recommend migrating to FireFox. Of course, with migrating platforms, it's gonna be annoying, but thankfully you can import most saved items from Chrome into FireFox, which will lessen the annoyance.<br>Lastly, I have released a theme for FireFox that expands the theme on this site to the rest of your browser, which you can get at <a href=\"https://addons.mozilla.org/en-US/firefox/addon/roket-s-hub-theme\" target=\"_blank\" rel=\"noopener noreferrer\">this link</a>",
        "edited":false,
        "edited_date":null,
        "pinned":false
    },
    {
        "title": "2024 Ford Mustang",
        "date": "January 15th, 2023",
        "content": "Oof, it's been too long since the last post, but i have some information to hopefully make up for that.<br>I have official dates of order banks opening, scheduling, and job 1 for the '24 Mustang, confirmed by Ford (not speculation!)<br><table class=\"center\"><tr><th>Order Banks Open</th><th>January 23rd, 2023</th></tr><tr><th>Scheduling Starts</th><th>February 9th, 2023</th></tr><tr><th>Job 1 Production</th><th>April 17th, 2023</th></tr></table><br>There's also official power numbers now! Ford announced them, but I'll share them here.<br><table class=\"center\"><tr><th>Vehicle</th><th>Horsepower</th><th>Torque ft-lbs</th></tr><tr><th>EcoBoost</th><th>315HP</th><th>350ft-lbs</th></tr><tr><th>GT</th><th>480HP</th><th>415ft-lbs</th></tr><tr><th>GT w/ Active Exhaust</th><th>486HP</th><th>418ft-lbs</th></tr><tr><th>Dark Horse</th><th>500HP</th><th>418ft-lbs</th></tr></table><br>No order guides or price lists have been released yet, but I will post them on Mustang7G when they are, assuming i'm the first one to actually find them.<br>I also have a render of how the paints might looks that I made, note that they're probably not 100% accurate, but it's good information to see roughly how they'll look.<br><img src=\"https://www.mustang7g.com/forums/attachments/1673766497853-png.559841/\" loading=\"lazy\" class=\"hugeimg\"><br>In order, Atlas Blue, Blue Ember, Carbonized Grey, Dark Matter Grey, Grabber Blue Metallic, Ingot Silver, Oxford White, Race Red, Rapid Red, Shadow Black, Vapor Blue, and Splash Yellow<br>My current plan is to get a Dark Horse, not sure what color yet, and whether not it'll have the appearance package will hinge on if the \"blue carbon fiber wheels\" rumor is true.<br>If it's true, I don't know what color I'll get, as I like them all. If it's not true, I might get it without the appearance package in either Dark Matter Grey or Race Red. If for some reason I can't get a Dark Horse, i have 2 fallback plans.<br>1. If the Ecoboost High Output has a chassis number, get that with the handling package in Yellow Splash.<br>2. If the Ecoboost High Output doesn't have a chassis number, get the GT with performance package in Yellow Splash.<br><br>Now, on to a small update to the website, there's a new tab called \"Tools\". In there is any cool tools I make and want to share, and first up in a VIN checking tool.<br>It'll tell you if the VIN is valid and whether or not the check bit is right. If it's not, it'll calculate the correct check bit and tell you!<br><br>Well, that's it for now, I'll see y'all later!",
        "edited":false,
        "edited_date":null,
        "pinned":false
    },
    {
        "title": "2024 Mustang Build and Price!",
        "date": "March 14th, 2023",
        "content": "First, i just want to say sorry about being wrong about the dates, blame Ford for that<br>anyways, i have big news! I have made and released my own 2024 Mustang build and price tool! You can access it from the \"Tools\" tab",
        "edited":false,
        "edited_date":null,
        "pinned":false
    },
    {
        "title":"Dark Horse Order",
        "date":"April 5th, 2023",
        "content":"Here we go again, i've placed an order for a Mustang, this time a Dark Horse<br><img src=\"https://www.mustang7g.com/forums/attachments/1680646070678-png.561127/\" loading=\"lazy\" class=\"hugeimg\">",
        "edited":false,
        "edited_date":null,
        "pinned":true
    }
]